<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"  
  "http://www.w3.org/TR/html4/loose.dtd">  
<html > 
<head><title>djview4shapes</title> 
<meta http-equiv="Content-Type" content="text/html; charset=utf8"> 
<meta name="generator" content="TeX4ht (http://www.cse.ohio-state.edu/~gurari/TeX4ht/)"> 
<meta name="originator" content="TeX4ht (http://www.cse.ohio-state.edu/~gurari/TeX4ht/)"> 
<!-- html --> 
<meta name="src" content="djview4shapes_pl.tex"> 
<meta name="date" content="2012-07-11 06:35:00"> 
</head><body 
>
   <div class="maketitle">



<h2 class="titleHead">djview4shapes</h2>
<div class="author" ><span 
class="plr-12">Janusz S. Bie&#324;</span></div><br />
<div class="date" ></div>
   </div>
<!--l. 13--><p class="indent" >   Program stanowi modyfikacj&#281; przegl&#261;darki <span 
class="plss-10">djview4</span>
(<a 
href="http://djvu.sourceforge.net/djview4.html" class="url" ><span 
class="pltt-10">http://djvu.sourceforge.net/djview4.html</span></a>), przeznaczon&#261; do wy&#347;wietlania
zawarto&#347;ci s&#322;owników kszta&#322;tów wspólnych zawartych w dokumencie DjVu. S&#322;owniki
te tworzone s&#261; na potrzeby kompresji, ale mog&#261; by&#263; wykorzystane do ustalenia
repertuaru kszta&#322;tów znaków i przygotowywania dnych do trenowania programów
OCR.
<!--l. 20--><p class="indent" >   W wersji dla MS Windows mo&#380;e by&#263; potrzebne wskazanie lokalizacji programu
<span 
class="plss-10">djview4 </span>w panelu <span 
class="pltt-10">Ustawienia --- Skonfiguruj --- Ogólne</span>.
<!--l. 24--><p class="indent" >   Sposób korzystania z programu jest oczywisty z drobnymi wyj&#261;tkami (niektóre z
nich s&#261; odziedziczone po <span 
class="plss-10">djview4</span>):
     <ul class="itemize1">
     <li class="itemize">pojedyncze klikni&#281;cie lewym klawiszem myszy na ksza&#322;t w bocznym panelu
     prze&#322;&#261;cza mi&#281;dzy wybraniem pojedynczego kszta&#322;tu a drzewem kszta&#322;tów,
     dla  którego  jest  on  korzeniem;  wsyt&#261;pienia  kszta&#322;tu  lub  kszta&#322;tów  s&#261;
     wy&#347;wietlane w panelu konkordancji z lewej strony,
     </li>
     <li class="itemize">pojedyncze  klikni&#281;cie  prawym  klawiszem  myszy  na  ksza&#322;t  w  bocznym
     panelu eksportuje wybrane kszta&#322;ty w formi plików graficznych,
     </li>
     <li class="itemize">pojedyncze  klikni&#281;cie  lewym  klawiszem  w  panelu  g&#322;ównym  wybiera
     odpowiedni kszta&#322;t w bocznym panelu,
     </li>
     <li class="itemize">podwójne  klikni&#281;cie  lewym  klawiszem  myszy  na  panel  konkordancji
     wy&#347;wietla odpowiedni&#261; stron&#281; w oknie g&#322;ównym,
     </li>
     <li class="itemize">klikni&#281;cie &#347;rodkowym klawiszem myszy na panel konkordancji uruchamia
     nowy egzemplarz <span 
class="plss-10">djview4 </span>wy&#347;wietlaj&#261;cy odpowiedni&#261; stron&#281;,

     </li>
     <li class="itemize">wcisni&#281;cie lewego klawisza myszy pozwala pozycjonowa&#263; tekst w oknie,
     </li>
     <li class="itemize">wci&#347;ni&#281;cie klawisza <span 
class="pltt-10">Ctrl </span>pozwala wykorzysta&#263; rolk&#281; myszy do skalowania
     tekstu w oknie.</li></ul>
<!--l. 47--><p class="indent" >   Kszta&#322;ty w prawym panelu s&#261; wy&#347;wietlane dla liczby stron wskazanej w
ustawieniach. Podanie du&#380;ej liczby mo&#380;e powodowa&#263; czasoch&#322;onne obliczenia.
      <!--l. 51--><p class="indent" >   Zalecanym sposobem zg&#322;aszania b&#322;&#281;dów i problemów jest korzystanie z zak&#322;adek Issues i Discussion w obecnym repozytorium programu
<a href="https://github.com/jsbien/djview4shapes" class="url" ><span 
class="cmtt-10">https://github.com/jsbien/djview4shapes</span></a>.
        
</body></html> 



